SEGUROS/ProcesadorSCGI/test.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://tempuri.org/">
 <SOAP-ENV:Body>
   <ns1:wmImed_SrvConfirmacion>
    <ns1:XML_INPUT>
<MsgInput>
<extCodFinanciador>12</extCodFinanciador>
<extCodSeguro>41</extCodSeguro>
<extCodLugar>5132</extCodLugar>
<extNumOperacion>5894</extNumOperacion>
<extRutBeneficiario>0012549775-6</extRutBeneficiario>
<extRutPrestador>0088770500-3</extRutPrestador>
<extLisPrest1>0101855   |00|01|0000015700|0000003140|</extLisPrest1>
<extLisPrest2> </extLisPrest2>
<extLisPrest3> </extLisPrest3>
<extLisPrest4> </extLisPrest4>
<extLisPrest5> </extLisPrest5>
<extLisPrest6> </extLisPrest6>
</MsgInput>
</ns1:XML_INPUT>
   </ns1:wmImed_SrvConfirmacion>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
